app/controllers/initialization_controller.rb

SELECT "users".* FROM "users" WHERE "users"."api_key" = 'abc123' LIMIT 1
---
	def ios_init
		@developer = User.where(api_key: params[:api_key]).first