app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = 1
---
  def index
    @items = Item.where(:user_id => current_user.id)