app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "desc", "display_text", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "item_type", "name", "options", "price", "sku", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def update
    @item = Item.find(params[:id])